app/controllers/songs_controller.rb

  def new
    if params[:artist_id]
      if Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"